---
kind: method
id: M:Autodesk.Revit.DB.LevelAssociationData.GetAssociatedLevel
source: html/edde8824-2335-4e54-f794-90b698b714a4.htm
---
# Autodesk.Revit.DB.LevelAssociationData.GetAssociatedLevel Method

Returns the Associated Level id.

## Syntax (C#)
```csharp
public ElementId GetAssociatedLevel()
```